# ComponentRotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..ComponentRotation Property
DividedSurface Class See Also
---
The rotation of the pattern by a multiple of 90 degrees.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ComponentRotation ComponentRotation { get; set; }
```

Visual Basic
---
```text
Public Property ComponentRotation As ComponentRotation
	Get
	Set
```

Visual C++
---
```text
public:
property ComponentRotation ComponentRotation {
	ComponentRotation get ();
	void set (ComponentRotation value);
}
```

# Remarks
This property has no effect unless a pattern is selected (the ObjectType property is not nullNothingnullptra null reference (Nothing in Visual Basic)).
# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace